## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**❌ &nbsp; Terraform Validate:** `failed`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

<details>
<summary>Show Validate results</summary>

```sh
[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mFailed to load state: RequestError: send request failed
[31m│[0m [0mcaused by: Get &quot;https://s3.ca-central-1.amazonaws.com/forms-staging-tfstate/cloud/network/terraform.tfstate&quot;: read tcp 10.1.0.4:50988-&gt;52.95.190.49:443: read: connection reset by peer[0m
[31m│[0m [0m
[31m│[0m [0m[0m
[31m╵[0m[0m
time=2023-11-16T19:03:29Z level=error msg=terraform invocation failed in /home/runner/work/forms-terraform/forms-terraform/env/cloud/network/.terragrunt-cache/w9s2u6veEo-8OfcfrWay3E5UM9E/-syjFrdAaB-6kNXhMmF1nXBOp7o/network prefix=[/home/runner/work/forms-terraform/forms-terraform/env/cloud/network] 
time=2023-11-16T19:03:29Z level=error msg=1 error occurred:
	* [/home/runner/work/forms-terraform/forms-terraform/env/cloud/network/.terragrunt-cache/w9s2u6veEo-8OfcfrWay3E5UM9E/-syjFrdAaB-6kNXhMmF1nXBOp7o/network] exit status 1



```

</details>

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| update | `aws_cloudfront_distribution.maintenance_mode`         |
| add    | `aws_s3_bucket_website_configuration.maintenance_mode` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.maintenance_mode will be updated in-place
  ~ resource "aws_cloudfront_distribution" "maintenance_mode" {
        id                             = "E2NX6QAIR13JTM"
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ minimum_protocol_version       = "TLSv1.2_2019" -> "TLSv1.2_2021"
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_website_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_website_configuration" "maintenance_mode" {
      + bucket           = "gc-forms-application-maintenance-page"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]

22 tests, 19 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
